app/controllers/game_controller.rb

SELECT  "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def view
    @team = session[:team]
    @territoryMap = Map.find(1)

SELECT  "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    # Users without admin perms are not allowed to view edit page.
    # Code below reinforces this.
    if session[:team] != 0
      redirect_to :controller=>'sessions',:action=>'new'
    end
    @territoryMap = Map.find(1)

SELECT  "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def modify
    index = -1
    if params[:map][:newVal].to_i < 8
      index = 1
    end
    if params[:map][:newVal].to_i > 7 && params[:map][:newVal].to_i < 15
      index = 2
    end
    if params[:map][:newVal].to_i > 14
      index = 3
    end
    map = Map.find(index)

UPDATE "maps" SET "data" = ?, "updated_at" = ? WHERE "maps"."id" = ?
---
    puts ("New value: " + newVal.to_s + "\n")
    puts ("Full map: " + map.data.to_s + "\n")
    puts ("Index placed: " + indexPlaced.to_s)
    map.save

INSERT INTO "users" ("username", "team", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
  def createUser
    @user = User.new()
    @user.team = params[:user][:team]
    @user.username = params[:user][:username]
    @user.password = params[:user][:password]
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "hi"], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 10]]
---
  def deleteUser
    user = User.find_by(username: params[:user][:username])
    if user != nil
      if user.authenticate(params[:user][:password])
        user.destroy

SELECT  "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def randomizeMap
    @territoryMap = Map.find(1)

UPDATE "maps" SET "data" = ?, "updated_at" = ? WHERE "maps"."id" = ?
---
    puts (@resourceMap.data + "\n")
    puts (@personMap.data + "\n")

    @territoryMap.save